Tekla Open API Reference for Tekla Structures 2025
BoltHoleAttributes Properties
The BoltHoleAttributes type exposes the following members.
Properties
Name | Description
HoleType
 The special hole type: oversized, tapped, slotted, blind or no hole.
LongHoleX
 The long hole X value.
LongHoleY
 The long hole Y value.
SlotOffsetX
 The slot offset X value.
SlotOffsetY
 The slot offset Y value.
Top
See Also
Reference
BoltHoleAttributes Class
Tekla.Structures.Model Namespace